In [1]:
from ipywidgets import interact 
import ipywidgets as widgets
from sqlalchemy import create_engine

In [2]:
%load_ext sql

engine = create_engine('postgresql://postgres:pgadmin@localhost/airbnb_icmc')
%sql postgresql://postgres:pgadmin@localhost/airbnb_icmc

In [3]:
%config SqlMagic.autocommit=False

In [4]:
%%sql 
COMMIT;
DROP DATABASE IF EXISTS airbnb_icmc WITH (FORCE);
COMMIT;
CREATE DATABASE airbnb_icmc
    WITH OWNER = postgres
    ENCODING = 'UTF8';
COMMIT;

 * postgresql://postgres:***@localhost/airbnb_icmc
Done.
(psycopg2.errors.ObjectInUse) cannot drop the currently open database

[SQL: DROP DATABASE IF EXISTS airbnb_icmc WITH (FORCE);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [5]:
%config SqlMagic.autocommit=True

In [6]:
%sql SELECT CURRENT_DATABASE();

 * postgresql://postgres:***@localhost/airbnb_icmc
1 rows affected.

[('airbnb_icmc',)]

In [13]:
%%sql
DROP TABLE IF EXISTS Usuario, Propriedade, Conta_bancaria, Avaliar, Conversar, Reservar, Localizacao, Locacao, Quarto, Anfitriao, Locatario CASCADE;

 * postgresql://postgres:***@localhost/airbnb_icmc
Done.

[]

In [14]:
%%sql 
DROP TYPE IF EXISTS tipo_locacao, tipo_sexo, tipo_camas, tipo_conta, tipo_nota, tipo_usuario CASCADE;

 * postgresql://postgres:***@localhost/airbnb_icmc
Done.

[]

In [15]:
%%sql

CREATE TYPE tipo_locacao AS ENUM {"quarto", "propriedade"}; 
CREATE TYPE tipo_sexo AS ENUM {"F", "M"};
CREATE TYPE tipo_camas AS ENUM {"solteiro", "casal", "beliche"};
CREATE TYPE tipo_conta AS ENUM {"corrente", "poupança"};
CREATE TYPE tipo_nota AS ENUM {'1', '2', '3', '4', '5'};
CREATE TYPE tipo_usuario AS ENUM {"locatário", "proprietário", "locatário e proprietário"};

 * postgresql://postgres:***@localhost/airbnb_icmc
Done.
Done.
Done.
Done.
Done.
Done.

[]

In [17]:
%%sql

CREATE TABLE Usuario(
  nome             VARCHAR(70),
  sobrenome        VARCHAR(70),
  num_tel          VARCHAR(11),
  tipo             tipo_usuario,
  rua              VARCHAR(50),
  numero           INTEGER,
  complemento      VARCHAR(40),
  dt_nascimento    DATE,
  sexo             tipo_sexo,
  email            VARCHAR(50) UNIQUE NOT NULL,
  senha            VARCHAR(40) NOT NULL,
  PRIMARY KEY (nome, sobrenome, num_tel)
);

CREATE TABLE Propriedade(
  nome             VARCHAR(70),
  rua              VARCHAR(50),
  numero           INTEGER,
  complemento      VARCHAR(40),
  nome_usr         VARCHAR(70),
  sobrenome_usr    VARCHAR(70),
  num_tel_usr      VARCHAR(11),
  num_quartos      INTEGER NOT NULL,
  num_banheiros    INTEGER NOT NULL,
  tipo_hospedagem  tipo_locacao NOT NULL,
  preco_noite      DECIMAL(2) NOT NULL,
  num_max_hosp     INTEGER NOT NULL,
  num_min_noites   INTEGER NOT NULL,
  num_max_noites   INTEGER NOT NULL,
  taxa_limpeza     DECIMAL(2),
  horario_check_in  TIME,
  horario_check_out TIME,
  PRIMARY KEY (nome, rua, numero),
  FOREIGN KEY (nome_usr, sobrenome_usr, num_tel_usr) REFERENCES Usuario (nome, sobrenome, num_tel)
);

 * postgresql://postgres:***@localhost/airbnb_icmc
Done.
Done.

[]

In [18]:
%sql SELECT * FROM Propriedade;

 * postgresql://postgres:***@localhost/airbnb_icmc
0 rows affected.

[]

In [19]:
%%sql

CREATE TABLE Quarto(
  num_quarto        INTEGER,
  nome_prop         VARCHAR(70),
  rua_prop          VARCHAR(50),
  num_prop          INTEGER,
  num_de_camas      INTEGER NOT NULL, 
  tipo_de_cama     tipo_camas NOT NULL,
  PRIMARY KEY (num_quarto, nome_prop, rua_prop, num_prop),
  FOREIGN KEY (nome_prop, rua_prop, num_prop) REFERENCES Propriedade (nome, rua, numero)
);

CREATE TABLE Conta_bancaria(
  num_conta         VARCHAR(15),
  nome_usr          VARCHAR(70),
  sobrenome_usr     VARCHAR(70),
  num_tel_usr       VARCHAR(11),
  num_roteamento    VARCHAR(50) NOT NULL,
  tipo_conta        tipo_conta NOT NULL,
  PRIMARY KEY (num_conta, nome_usr, sobrenome_usr, num_tel_usr),
  FOREIGN KEY (nome_usr, sobrenome_usr, num_tel_usr) REFERENCES Usuario (nome, sobrenome, num_tel)
);

CREATE TABLE Avaliar(
  nome_usr               VARCHAR(70),
  sobrenome_usr          VARCHAR(70),
  num_tel_usr            VARCHAR(11),
  nome_prop              VARCHAR(70),
  rua_prop               VARCHAR(50),
  num_prop               INTEGER,
  mensagem               TEXT,
  nota_limpeza           tipo_nota NOT NULL,
  nota_comunicacao       tipo_nota NOT NULL,
  nota_localizacao       tipo_nota NOT NULL,
  nota_valor             tipo_nota NOT NULL,
  PRIMARY KEY (nome_usr, sobrenome_usr, num_tel_usr, nome_prop, rua_prop, num_prop),
  FOREIGN KEY (nome_usr, sobrenome_usr, num_tel_usr) REFERENCES Usuario (nome, sobrenome, num_tel),
  FOREIGN KEY (nome_prop, rua_prop, num_prop) REFERENCES Propriedade (nome, rua, numero)
);

CREATE TABLE Conversar(
  nome_dest              VARCHAR(70),
  sobrenome_dest         VARCHAR(70),
  num_tel_dest           VARCHAR(11),
  nome_rem               VARCHAR(70),
  sobrenome_rem          VARCHAR(70),
  num_tel_rem            VARCHAR(11),
  horario_mensagem       TIME NOT NULL,
  mensagem               TEXT NOT NULL,
  PRIMARY KEY (nome_dest, sobrenome_dest, num_tel_dest, nome_rem, sobrenome_rem, num_tel_rem),
  FOREIGN KEY (nome_dest, sobrenome_dest, num_tel_dest) REFERENCES Usuario (nome, sobrenome, num_tel),
  FOREIGN KEY (nome_rem, sobrenome_rem, num_tel_rem) REFERENCES Usuario (nome, sobrenome, num_tel)
);

CREATE TABLE Reservar(
  nome_prop              VARCHAR(70),
  rua_prop               VARCHAR(50),
  num_prop               INTEGER,
  nome_usr               VARCHAR(70),
  sobrenome_usr          VARCHAR(70),
  num_tel_usr            VARCHAR(11),
  data_check_in          DATE,
  data_reserva           DATE,
  confirmacao            BOOLEAN DEFAULT FALSE,
  PRIMARY KEY (nome_prop, rua_prop, num_prop, nome_usr, sobrenome_usr, num_tel_usr, data_check_in),
  FOREIGN KEY (nome_prop, rua_prop, num_prop) REFERENCES Propriedade (nome, rua, numero),
  FOREIGN KEY (nome_usr, sobrenome_usr, num_tel_usr) REFERENCES Usuario (nome, sobrenome, num_tel)
);

CREATE TABLE Locacao(
  data_check_in    DATE,
  data_check_out   DATE,
  nome_prop        VARCHAR(70),
  rua_prop         VARCHAR(50),
  num_prop         INTEGER,
  nome_usr         VARCHAR(70),
  sobrenome_usr    VARCHAR(70),
  num_tel_usr      VARCHAR(11),
  confirmacao         BOOLEAN DEFAULT FALSE,
  num_hospedes        INTEGER,
  valor               DECIMAL(2),
  imposto             DECIMAL(2),
  codigo_promocao     VARCHAR(50), 
  desconto            DECIMAL(2),
  valor_total         DECIMAL(2),
  PRIMARY KEY (data_check_in, nome_prop, rua_prop, num_prop, nome_usr, sobrenome_usr, num_tel_usr),
  FOREIGN KEY (nome_prop, rua_prop, num_prop) REFERENCES Propriedade (nome, rua, numero),
  FOREIGN KEY (nome_usr, sobrenome_usr, num_tel_usr) REFERENCES Usuario (nome, sobrenome, num_tel)
);

CREATE TABLE Localizacao(
  cidade         VARCHAR(40),
  estado         VARCHAR(20),
  pais           VARCHAR(30),
  bairro         VARCHAR(50),
  nome_usr       VARCHAR(70),
  sobrenome_usr  VARCHAR(70),
  num_tel_usr    VARCHAR(11),
  nome_prop      VARCHAR(70),
  rua_prop       VARCHAR(50),
  num_prop       INTEGER,
  PRIMARY KEY (cidade, estado, pais),
  FOREIGN KEY (nome_usr, sobrenome_usr, num_tel_usr) REFERENCES Usuario (nome, sobrenome, num_tel),
  FOREIGN KEY (nome_prop, rua_prop, num_prop) REFERENCES Propriedade (nome, rua, numero)
);

 * postgresql://postgres:***@localhost/airbnb_icmc
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

In [20]:
%%sql 

INSERT INTO Usuario (nome, sobrenome, num_tel, tipo, rua, numero, complemento, dt_nascimento, sexo, email, senha) VALUES 
      ('João', 'Silva', '12345678901', 'proprietário', 'Rua das Flores', 123, 'Apto 101', '1980-05-15', 'M', 'joao@example.com', 'senha123'),
      ('Maria', 'Santos', '98765432101', 'locatário', 'Avenida Principal', 456, NULL, '1985-09-20', 'F', 'maria@example.com', 'senha456'),
      ('Carlos', 'Ferreira', '55555555555', 'proprietário', 'Rua do Comércio', 789, NULL, '1975-12-10', 'M', 'carlos@example.com', 'senha789'),
      ('Ana', 'Oliveira', '99999999999', 'locatário', 'Rua Central', 321, 'Casa 2', '1992-04-25', 'F', 'ana@example.com', 'senha987');

 * postgresql://postgres:***@localhost/airbnb_icmc
4 rows affected.

[]

In [21]:
%%sql 
SELECT * FROM Usuario;

 * postgresql://postgres:***@localhost/airbnb_icmc
4 rows affected.

[('João', 'Silva', '12345678901', 'proprietário', 'Rua das Flores', 123, 'Apto 101', datetime.date(1980, 5, 15), 'M', 'joao@example.com', 'senha123'),
 ('Maria', 'Santos', '98765432101', 'locatário', 'Avenida Principal', 456, None, datetime.date(1985, 9, 20), 'F', 'maria@example.com', 'senha456'),
 ('Carlos', 'Ferreira', '55555555555', 'proprietário', 'Rua do Comércio', 789, None, datetime.date(1975, 12, 10), 'M', 'carlos@example.com', 'senha789'),
 ('Ana', 'Oliveira', '99999999999', 'locatário', 'Rua Central', 321, 'Casa 2', datetime.date(1992, 4, 25), 'F', 'ana@example.com', 'senha987')]

In [22]:
%%sql
INSERT INTO Propriedade VALUES 
      ('Casa na Praia', 'Rua das Ondas', 100, 'Casa 1', 'João', 'Silva', '12345678901', 3, 2, 'propriedade', 80.00, 6, 2, 15, 50.00, '14:00:00', '10:00:00');

 * postgresql://postgres:***@localhost/airbnb_icmc
1 rows affected.

[]

In [23]:
%sql SELECT * FROM Propriedade;

 * postgresql://postgres:***@localhost/airbnb_icmc
1 rows affected.

[('Casa na Praia', 'Rua das Ondas', 100, 'Casa 1', 'João', 'Silva', '12345678901', 3, 2, 'propriedade', Decimal('80'), 6, 2, 15, Decimal('50'), datetime.time(14, 0), datetime.time(10, 0))]